results/rabbit/stage-100/payload-heavy/100VUs/repeat-3/100vus-summary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./src/rabbit/rabbitTest.js
        output: json (./results/rabbit/stage-100/payload-heavy/100VUs/repeat-3/100vus.json)

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 100 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 100/100 VUs, 400 complete and 0 interrupted iterations
default   [   2% ] 100 VUs  0m01.0s/1m0s

running (0m02.0s), 100/100 VUs, 900 complete and 0 interrupted iterations
default   [   3% ] 100 VUs  0m02.0s/1m0s

running (0m02.5s), 100/100 VUs, 1327 complete and 0 interrupted iterations
default   [   5% ] 100 VUs  0m03.0s/1m0s

running (0m02.9s), 100/100 VUs, 1811 complete and 0 interrupted iterations
default   [   7% ] 100 VUs  0m04.0s/1m0s

running (0m03.9s), 100/100 VUs, 2303 complete and 0 interrupted iterations
default   [   8% ] 100 VUs  0m05.0s/1m0s

running (0m04.9s), 100/100 VUs, 2788 complete and 0 interrupted iterations
default   [  10% ] 100 VUs  0m06.0s/1m0s

running (0m05.9s), 100/100 VUs, 3236 complete and 0 interrupted iterations
default   [  12% ] 100 VUs  0m07.0s/1m0s

running (0m06.9s), 100/100 VUs, 3720 complete and 0 interrupted iterations
default   [  13% ] 100 VUs  0m08.0s/1m0s

running (0m07.9s), 100/100 VUs, 4209 complete and 0 interrupted iterations
default   [  15% ] 100 VUs  0m09.0s/1m0s

running (0m08.9s), 100/100 VUs, 4699 complete and 0 interrupted iterations
default   [  17% ] 100 VUs  0m10.0s/1m0s

running (0m09.9s), 100/100 VUs, 5178 complete and 0 interrupted iterations
default   [  18% ] 100 VUs  0m11.0s/1m0s

running (0m10.9s), 100/100 VUs, 5636 complete and 0 interrupted iterations
default   [  20% ] 100 VUs  0m12.0s/1m0s

running (0m11.9s), 100/100 VUs, 6117 complete and 0 interrupted iterations
default   [  22% ] 100 VUs  0m13.0s/1m0s

running (0m12.9s), 100/100 VUs, 6605 complete and 0 interrupted iterations
default   [  23% ] 100 VUs  0m14.0s/1m0s

running (0m13.9s), 100/100 VUs, 7085 complete and 0 interrupted iterations
default   [  25% ] 100 VUs  0m15.0s/1m0s

running (0m14.9s), 100/100 VUs, 7548 complete and 0 interrupted iterations
default   [  27% ] 100 VUs  0m16.0s/1m0s

running (0m15.9s), 100/100 VUs, 8044 complete and 0 interrupted iterations
default   [  28% ] 100 VUs  0m17.0s/1m0s

running (0m16.9s), 100/100 VUs, 8522 complete and 0 interrupted iterations
default   [  30% ] 100 VUs  0m18.0s/1m0s

running (0m17.9s), 100/100 VUs, 8996 complete and 0 interrupted iterations
default   [  32% ] 100 VUs  0m19.0s/1m0s

running (0m18.9s), 100/100 VUs, 9482 complete and 0 interrupted iterations
default   [  33% ] 100 VUs  0m20.0s/1m0s

running (0m19.9s), 100/100 VUs, 9952 complete and 0 interrupted iterations
default   [  35% ] 100 VUs  0m21.0s/1m0s

running (0m20.9s), 100/100 VUs, 10436 complete and 0 interrupted iterations
default   [  37% ] 100 VUs  0m22.0s/1m0s

running (0m21.9s), 100/100 VUs, 10926 complete and 0 interrupted iterations
default   [  38% ] 100 VUs  0m23.0s/1m0s

running (0m22.9s), 100/100 VUs, 11398 complete and 0 interrupted iterations
default   [  40% ] 100 VUs  0m24.0s/1m0s

running (0m23.9s), 100/100 VUs, 11856 complete and 0 interrupted iterations
default   [  42% ] 100 VUs  0m25.0s/1m0s

running (0m24.9s), 100/100 VUs, 12343 complete and 0 interrupted iterations
default   [  43% ] 100 VUs  0m26.0s/1m0s

running (0m25.9s), 100/100 VUs, 12820 complete and 0 interrupted iterations
default   [  45% ] 100 VUs  0m27.0s/1m0s

running (0m26.9s), 100/100 VUs, 13301 complete and 0 interrupted iterations
default   [  47% ] 100 VUs  0m28.0s/1m0s

running (0m27.9s), 100/100 VUs, 13759 complete and 0 interrupted iterations
default   [  48% ] 100 VUs  0m29.0s/1m0s

running (0m28.9s), 100/100 VUs, 14257 complete and 0 interrupted iterations
default   [  50% ] 100 VUs  0m30.0s/1m0s

running (0m29.9s), 100/100 VUs, 14734 complete and 0 interrupted iterations
default   [  52% ] 100 VUs  0m31.0s/1m0s

running (0m30.9s), 100/100 VUs, 15196 complete and 0 interrupted iterations
default   [  53% ] 100 VUs  0m32.0s/1m0s

running (0m31.9s), 100/100 VUs, 15675 complete and 0 interrupted iterations
default   [  55% ] 100 VUs  0m33.0s/1m0s

running (0m31.8s), 100/100 VUs, 16162 complete and 0 interrupted iterations
default   [  57% ] 100 VUs  0m34.0s/1m0s

running (0m32.8s), 100/100 VUs, 16639 complete and 0 interrupted iterations
default   [  58% ] 100 VUs  0m35.0s/1m0s

running (0m33.8s), 100/100 VUs, 17102 complete and 0 interrupted iterations
default   [  60% ] 100 VUs  0m36.0s/1m0s

running (0m34.8s), 100/100 VUs, 17571 complete and 0 interrupted iterations
default   [  62% ] 100 VUs  0m37.0s/1m0s

running (0m35.8s), 100/100 VUs, 18069 complete and 0 interrupted iterations
default   [  63% ] 100 VUs  0m38.0s/1m0s

running (0m36.8s), 100/100 VUs, 18547 complete and 0 interrupted iterations
default   [  65% ] 100 VUs  0m39.0s/1m0s

running (0m37.8s), 100/100 VUs, 19015 complete and 0 interrupted iterations
default   [  67% ] 100 VUs  0m40.0s/1m0s

running (0m38.8s), 100/100 VUs, 19483 complete and 0 interrupted iterations
default   [  68% ] 100 VUs  0m41.0s/1m0s

running (0m39.8s), 100/100 VUs, 19975 complete and 0 interrupted iterations
default   [  70% ] 100 VUs  0m42.0s/1m0s

running (0m40.8s), 100/100 VUs, 20452 complete and 0 interrupted iterations
default   [  72% ] 100 VUs  0m43.0s/1m0s

running (0m41.8s), 100/100 VUs, 20928 complete and 0 interrupted iterations
default   [  73% ] 100 VUs  0m44.0s/1m0s

running (0m42.8s), 100/100 VUs, 21416 complete and 0 interrupted iterations
default   [  75% ] 100 VUs  0m45.0s/1m0s

running (0m43.8s), 100/100 VUs, 21881 complete and 0 interrupted iterations
default   [  77% ] 100 VUs  0m46.0s/1m0s

running (0m44.8s), 100/100 VUs, 22359 complete and 0 interrupted iterations
default   [  78% ] 100 VUs  0m47.0s/1m0s

running (0m45.8s), 100/100 VUs, 22829 complete and 0 interrupted iterations
default   [  80% ] 100 VUs  0m48.0s/1m0s

running (0m46.8s), 100/100 VUs, 23326 complete and 0 interrupted iterations
default   [  82% ] 100 VUs  0m49.0s/1m0s

running (0m47.8s), 100/100 VUs, 23789 complete and 0 interrupted iterations
default   [  83% ] 100 VUs  0m50.0s/1m0s

running (0m48.8s), 100/100 VUs, 24275 complete and 0 interrupted iterations
default   [  85% ] 100 VUs  0m51.0s/1m0s

running (0m49.8s), 100/100 VUs, 24763 complete and 0 interrupted iterations
default   [  87% ] 100 VUs  0m52.0s/1m0s

running (0m50.8s), 100/100 VUs, 25231 complete and 0 interrupted iterations
default   [  88% ] 100 VUs  0m53.0s/1m0s

running (0m51.8s), 100/100 VUs, 25694 complete and 0 interrupted iterations
default   [  90% ] 100 VUs  0m54.0s/1m0s

running (0m52.8s), 100/100 VUs, 26193 complete and 0 interrupted iterations
default   [  92% ] 100 VUs  0m55.0s/1m0s

running (0m53.8s), 100/100 VUs, 26670 complete and 0 interrupted iterations
default   [  93% ] 100 VUs  0m56.0s/1m0s

running (0m54.8s), 100/100 VUs, 27148 complete and 0 interrupted iterations
default   [  95% ] 100 VUs  0m57.0s/1m0s

running (0m55.8s), 100/100 VUs, 27612 complete and 0 interrupted iterations
default   [  97% ] 100 VUs  0m58.0s/1m0s

running (0m56.8s), 100/100 VUs, 28098 complete and 0 interrupted iterations
default   [  98% ] 100 VUs  0m59.0s/1m0s

running (0m57.8s), 100/100 VUs, 28581 complete and 0 interrupted iterations
default   [ 100% ] 100 VUs  1m00.0s/1m0s


  █ TOTAL RESULTS 

    CUSTOM
    benchmark_slow_failure_rate....: 0.00%  0 out of 28698
    benchmark_total_failure_rate...: 0.00%  0 out of 28698

    HTTP
    http_req_duration..............: avg=206.1ms  min=51.95µs  med=208.19ms max=254.64ms p(90)=212.5ms  p(95)=215.56ms
      { expected_response:true }...: avg=206.1ms  min=51.95µs  med=208.19ms max=254.64ms p(90)=212.5ms  p(95)=215.56ms
    http_req_failed................: 0.00%  0 out of 28698
    http_reqs......................: 28698  494.792858/s

    EXECUTION
    iteration_duration.............: avg=209.48ms min=200.91ms med=208.68ms max=256.39ms p(90)=213.27ms p(95)=216.58ms
    iterations.....................: 28698  494.792858/s
    vus............................: 100    min=100        max=100
    vus_max........................: 100    min=100        max=100

    NETWORK
    data_received..................: 7.1 MB 123 kB/s
    data_sent......................: 945 MB 16 MB/s



running (0m58.0s), 000/100 VUs, 28698 complete and 0 interrupted iterations
default ✓ [ 100% ] 100 VUs  1m0s